Revit 2027 API
BalusterInfo.Name Property
 The name of the baluster.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: name is an empty string or contains only whitespace. -or- When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace